tap "d12frosted/emacs-plus"
tap "dbcli/tap"

cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "font-iosevka"
cask "font-maple-mono"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-drive"
cask "httpie"
cask "keyboard-maestro"
cask "orbstack"
cask "rar"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zoom"

brew "age"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "bat"
brew "btop"
brew "clang-format"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-mailutils", "with-xwidgets", "with-imagemagick", "with-savchenkovaleriy-big-sur-3d-icon"], restart_service: :changed
brew "direnv"
brew "dive"
brew "docker"
brew "editorconfig"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "go-task"
brew "graphviz"
brew "grep"
brew "gum"
brew "helm-docs"
brew "htop"
brew "hugo"
brew "hunspell"
brew "jnv"
brew "jpeg"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "languagetool"
brew "lazygit"
brew "libvterm"
brew "lua"
brew "luarocks"
brew "mas"
brew "minikube"
brew "mise"
brew "mtr"
brew "neovim"
brew "nmap"
brew "openssl"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pngpaste"
brew "pre-commit"
brew "pwgen"
brew "python@3.11"
brew "python@3.12"
brew "readline"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "sqlite3"
brew "starship"
brew "stylua"
brew "the_silver_searcher"
brew "vivid"
brew "watch"
brew "wget"
brew "whois"
brew "xz"
brew "zellij"
brew "zk"
brew "zlib"
brew "zoxide"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900
mas "Perplexity", id: 6714467650
mas "Tailscale", id: 1475387142
