tap "alexei-led/spotinfo"
tap "argoproj/tap"
tap "d12frosted/emacs-plus"
tap "dbcli/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "iann0036/iamlive"
tap "loft-sh/tap"
tap "pulumi/tap"
tap "tilt-dev/tap"

cask "1password"
cask "1password-cli"
cask "audacity"
cask "chatgpt"
cask "chef-workstation"
cask "claude"
cask "claude-code"
cask "codex"
cask "discord"
cask "dropbox"
cask "elgato-stream-deck"
cask "font-iosevka"
cask "font-maple-mono"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-drive"
cask "goreleaser"
cask "httpie"
cask "keyboard-maestro"
cask "nordvpn"
cask "obs"
cask "orbstack"
cask "rar"
cask "raycast"
cask "slack"
cask "spotify"
cask "swiftbar"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

brew "age"
brew "alexei-led/spotinfo/spotinfo"
brew "ansible"
brew "ansible-lint"
brew "argocd"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "awscli"
brew "bat"
brew "btop"
brew "clang-format"
brew "clusterawsadm"
brew "clusterctl"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-mailutils", "with-xwidgets", "with-imagemagick", "with-savchenkovaleriy-big-sur-3d-icon"], restart_service: :changed
brew "direnv"
brew "dive"
brew "docker"
brew "editorconfig"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flyway"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "go-task"
brew "graphviz"
brew "grep"
brew "gum"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/consul-template"
brew "hashicorp/tap/envconsul"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "helm-docs"
brew "htop"
brew "hudochenkov/sshpass/sshpass"
brew "hugo"
brew "hunspell"
brew "iann0036/iamlive/iamlive"
brew "jnv"
brew "jpeg"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "languagetool"
brew "lazygit"
brew "libvterm"
brew "liquibase"
brew "lua"
brew "luarocks"
brew "mas"
brew "minikube"
brew "mise"
brew "mtr"
brew "neovim"
brew "nmap"
brew "opa"
brew "openconnect"
brew "openjdk@11"
brew "openssl"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pngpaste"
brew "postgresql@16", restart_service: :changed
brew "pre-commit"
brew "pulumi"
brew "pulumi/tap/esc"
brew "pulumi/tap/pulumictl"
brew "pwgen"
brew "python@3.11"
brew "python@3.12"
brew "readline"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "sqlite3"
brew "starship"
brew "steampipe"
brew "stern"
brew "stylua"
brew "temporal"
brew "the_silver_searcher"
brew "tilt"
brew "tilt-dev/tap/ctlptl"
brew "trivy"
brew "velero"
brew "vivid"
brew "watch"
brew "wget"
brew "whois"
brew "xz"
brew "zellij"
brew "zk"
brew "zlib"
brew "zoxide"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900
mas "Perplexity", id: 6714467650
mas "Tailscale", id: 1475387142
