tap "d12frosted/emacs-plus"
tap "dbcli/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "TheBoredTeam/boring-notch"

cask "1password"
cask "1password-cli"
cask "TheBoredTeam/boring-notch/boring-notch", args: { no_quarantine: true }
cask "bruno"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "discord"
cask "elgato-stream-deck"
cask "font-geist"
cask "font-geist-mono"
cask "font-iosevka"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "goreleaser"
cask "keyboard-maestro"
cask "mactex-no-gui"
cask "orbstack"
cask "rar"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"

brew "age"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "bat"
brew "bottom"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-mailutils", "with-xwidgets", "with-imagemagick"], restart_service: :changed
brew "direnv"
brew "dive"
brew "docker"
brew "editorconfig"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "graphviz"
brew "grep"
brew "gum"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/consul-template"
brew "hashicorp/tap/envconsul"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "helm"
brew "helm-docs"
brew "helmfile"
brew "htmlq"
brew "htop"
brew "hudochenkov/sshpass/sshpass"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "just"
brew "k9s"
brew "krew"
brew "kubecolor"
brew "kubectl"
brew "kubectx"
brew "kubie"
brew "kustomize"
brew "lazygit"
brew "libheif"
brew "libraw"
brew "libvterm"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "minikube"
brew "mise"
brew "mole"
brew "mtr"
brew "neovim"
brew "netpbm"
brew "nmap"
brew "node"
brew "openssl"
brew "opus"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "pngpaste"
brew "postgresql@18", restart_service: :changed
brew "pre-commit"
brew "pulumi"
brew "pulumi/tap/esc"
brew "pulumi/tap/pulumictl"
brew "pwgen"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "sqlite3"
brew "starship"
brew "stern"
brew "stylua"
brew "the_silver_searcher"
brew "tldr"
brew "uv"
brew "vivid"
brew "watch"
brew "wget"
brew "whois"
brew "xz"
brew "yq"
brew "zig"
brew "zlib"
brew "zoxide"

mas "1Password for Safari", id: 1569813296
mas "Perplexity", id: 6714467650
