tap "argoproj/tap"
tap "alexei-led/spotinfo"
tap "d12frosted/emacs-plus"
tap "dbcli/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "iann0036/iamlive"
tap "joshmedeski/sesh"
tap "loft-sh/tap"
tap "pulumi/tap"
tap "tilt-dev/tap"

cask "1password"
cask "1password-cli"
cask "audacity"
cask "brave-browser"
cask "discord"
cask "dropbox"
cask "elgato-stream-deck"
cask "font-iosevka"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-drive"
cask "httpie"
cask "insomnia"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "lastfm"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "skype"
cask "slack"
cask "telegram"
cask "todoist"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "wezterm"
cask "whatsapp"
cask "zoom"

brew "age"
brew "alexei-led/spotinfo/spotinfo"
brew "ansible"
brew "argocd"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "awscli"
brew "bat"
brew "btop"
brew "clusterawsadm"
brew "clusterctl"
brew "coreutils"
brew "direnv"
brew "dive"
brew "docker"
brew "editorconfig"
brew "eksctl"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-mailutils", "with-xwidgets", "with-imagemagick", "with-native-comp", "with-poll", "with-modern-doom-icon"], restart_service: :changed
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flyway"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "gnupg@2.2"
brew "go"
brew "go-task"
brew "goreleaser/tap/goreleaser"
brew "graphviz"
brew "grep"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/consul-template"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hudochenkov/sshpass/sshpass"
brew "hugo"
brew "hunspell"
brew "iann0036/iamlive/iamlive"
brew "jpeg"
brew "jnv"
brew "joshmedeski/sesh/sesh"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "languagetool"
brew "lazygit"
brew "libvterm"
brew "liquibase"
brew "loft-sh/tap/vcluster-experimental"
brew "lua"
brew "luarocks"
brew "mas"
brew "minikube"
brew "neovim"
brew "nmap"
brew "nodejs"
brew "opa"
brew "openconnect"
brew "openjdk@11"
brew "openssl"
brew "parallel"
brew "pipx"
brew "pngpaste"
brew "postgresql@15", restart_service: :changed
brew "pre-commit"
brew "pulumi"
brew "pulumi/tap/esc"
brew "pwgen"
brew "python@3.11"
brew "python@3.12"
brew "readline"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "sqlite3"
brew "starship"
brew "steampipe"
brew "stern"
brew "the_silver_searcher"
brew "tilt"
brew "tilt-dev/tap/ctlptl"
brew "velero"
brew "vivid"
brew "watch"
brew "wget"
brew "whois"
brew "xz"
brew "zellij"
brew "zk"
brew "zlib"
brew "zoxide"

mas "Tailscale", id: 1475387142
mas "Fantastical", id: 975937182
