tap "dbcli/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "hudochenkov/sshpass"
tap "iann0036/iamlive"
tap "railwaycat/emacsmacport"
tap "tilt-dev/tap"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "audacity"
cask "betterdiscord-installer"
cask "brave-browser"
cask "discord"
cask "dropbox"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-drive"
cask "jetbrains-toolbox"
cask "lastfm"
cask "logi-options-plus"
cask "nordvpn"
cask "notion"
cask "obs"
cask "obsidian"
cask "opera-gx"
cask "orbstack"
cask "rectangle"
cask "skype"
cask "slack"
cask "todoist"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zoom"


brew "age"
brew "argocd"
brew "awscli"
brew "bat"
brew "binutils"
brew "btop"
brew "chezmoi"
brew "colima"
brew "coreutils"
brew "direnv"
brew "dive"
brew "docker"
brew "editorconfig"
brew "emacs-mac", args: ["with-modules", "with-native-compilation", "with-emacs-sexy-icon", "with-imagemagick", "with-librsvg", "with-no-title-bars"]
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "gnupg@2.2"
brew "graphviz"
brew "grep"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/consul-template"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hudochenkov/sshpass/sshpass"
brew "hunspell"
brew "iann0036/iamlive/iamlive"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "lazygit"
brew "libvterm"
brew "lua"
brew "luarocks"
brew "mas"
brew "minikube"
brew "neovim"
brew "nmap"
brew "opa"
brew "openconnect"
brew "openssl"
brew "pipx"
brew "postgresql@15", restart_service: :changed
brew "pre-commit"
brew "pulumi"
brew "pwgen"
brew "python@3.11"
brew "readline"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "sqlite3"
brew "starship"
brew "steampipe"
brew "stern"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tilt"
brew "tilt-dev/tap/ctlptl"
brew "velero"
brew "vivid"
brew "watch"
brew "wget"
brew "whois"
brew "xz"
brew "zellij"
brew "zlib"
brew "zoxide"

mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
